_Rarzrabotki/Rarus/USO2/Documents/АУН_ЗаключениеДоговораАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>АУН_ЗаключениеДоговораАренды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АУН_Ставки</xr:Item>
				<xr:Item>InformationRegister.АУН_СтатусыОбъектовАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДепозита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьДепозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыПостояннаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыПеременнаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостояннаяЧастьАренднойПлаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПеременнаяЧастьАренднойПлаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/АУН_Ставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АУН_Ставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_СпособыНачисленияАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/АУН_ЗаключениеДоговораАренды/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьСуммыПостояннойЧасти();
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ТекущийДоговор = Объект.Договор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСуммыПостояннойЧасти();
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.АУН_ОбъектыНедвижимости"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаЗаключенияДоговора");
		Объект.ДатаЗаключенияДоговора = '00010101';
		Возврат;
	КонецЕсли;
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) Тогда
		ОбновитьСрокиАрендыСпроситьОбИзменении("Выровнять сроки в табличной части на дату начала срока действия?", 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаОкончанияДоговора");
		Объект.ДатаЗаключенияДоговора = '00010101';
		Возврат;
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) Тогда
		ОбновитьСрокиАрендыСпроситьОбИзменении("Выровнять сроки в табличной части на дату окончания срока действия?", 3);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
		
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьДепозитПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	ПартнерПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 	

	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ЗаполнитьСуммыПостояннойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	
	Объект.ЦенаВключаетНДС = ПолучитьПризнакВключенияНДСВЦенуИзСоглашения(Объект.Соглашение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостояннаяЧастьАренды

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные,"ПостояннаяЧастьАренднойПлаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриИзменении(Элемент)
	
	ЗаполнитьСуммыПостояннойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПересчитатьСуммуНДС(ТекущиеДанные, Объект.ЦенаВключаетНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АУН_ОбъектыНедвижимости.Форма.АУН_ФормаЭлемента", Новый Структура("Ключ", Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ОбъектАренды));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПеременнаяЧастьАренды

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные,"ПеременнаяЧастьАренднойПлаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ТекущиеДанные.СтавкаНДС = ПолучитьСтавкуНДСПоДоговору(ТекущийДоговор);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ЕдиницаИзмерения");
	Иначе
		ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыОбъектАрендыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АУН_ОбъектыНедвижимости.Форма.АУН_ФормаЭлемента", Новый Структура("Ключ", Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ОбъектАренды));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	АУН_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(Объект.ДатаЗаключенияДоговора, Объект.ДатаОкончанияДоговора, Объект.Договор, Оповещение);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
		
	//Видимость элементов формы на закладке "Депозит"
	Элементы.СуммаДепозита.Видимость = Объект.УчитыватьДепозит;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыПостояннойЧасти()
	
	ИтогоСумма = 0;
	ИтогоВсего = 0;
	ИтогоНДС = 0;
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда
			СтрокаТЧ.СтавкаНДС = ?(ЗначениеЗаполнено(СтрокаТЧ.Номенклатура.СтавкаНДС),СтрокаТЧ.Номенклатура.СтавкаНДС,Объект.Договор.СтавкаНДС);
		КонецЕсли;
		
		СтрокаТЧ.Сумма = Окр(АУН_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТЧ.Ставка) * СтрокаТЧ.Количество, 2);
		ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
		ПересчитатьСуммуНДС(СтрокаТЧ, Объект.ЦенаВключаетНДС);
		ИтогоНДС = ИтогоНДС + СтрокаТЧ.СуммаНДС;
		ИтогоВсего = ИтогоВсего + СтрокаТЧ.Всего;
		
	КонецЦикла;
	
	ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	
КонецПроцедуры

&НаКлиенте
//Процедура предназначена для выравнивания сроков аренды объектов на границы действия договора
Процедура ОбновитьСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьСоСрокамиДоговора(Значение)
	
	Если Значение < Объект.ДатаЗаключенияДоговора Тогда
		Значение = Объект.ДатаЗаключенияДоговора;
	ИначеЕсли Значение > Объект.ДатаОкончанияДоговора Тогда
		Значение = Объект.ДатаОкончанияДоговора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВсего(ТекущиеДанные, ЦенаВключаетНДС)

	ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ?(ЦенаВключаетНДС, 0, ТекущиеДанные.СуммаНДС);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСуммуНДС(ТекущиеДанные, ЦенаВключаетНДС)

	//ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущиеДанные.СтавкаНДС);
	ТекущиеДанные.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущиеДанные.Сумма, ТекущиеДанные.СтавкаНДС, ЦенаВключаетНДС);
	ПересчитатьВсего(ТекущиеДанные, ЦенаВключаетНДС);
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрагентОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем"));
	
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту"));
	
	СтруктураОтбора = Новый Структура("ЗначениеОтбора", Истина); 
	СтруктураПараметров = Новый Структура("АУН_АрендныйДоговор", СтруктураОтбора);
	
	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(
		Объект.Договор, Объект.Контрагент, Объект.Организация, 
		СписокВидовДоговоров, СтруктураПараметров);
		
	Объект.НаправлениеДеятельности = Объект.Договор.НаправлениеДеятельности;

КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	КонтрагентОбработатьИзменение();
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитовТабличнойЧасти

&НаКлиенте
Процедура ПриВыбореОбъектаАренды(ТекСтрока,ИмяТЧ)
	
	ТекСтрока.Количество = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекСтрока.ОбъектАренды, "ОбщаяПлощадь");
	
	ЗаполнитьДанныеПоСтроке(Элементы[ИмяТЧ].ТекущиеДанные.ПолучитьИдентификатор(),ИмяТЧ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСтроке(ИдСтроки,ИмяТЧ)
	
	ТекСтрока = Объект[ИмяТЧ].НайтиПоИдентификатору(ИдСтроки);
	СтруктураОтбора = Новый Структура("ОбъектНедвижимости",ТекСтрока.ОбъектАренды); 	
	
	НЗ = РегистрыСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(Объект.Дата,СтруктураОтбора);
	
	Если НЗ.Количество() Тогда
		ТекСтрока.Количество = НЗ.Получить(0).ОбщаяПлощадь;
	КонецЕсли;   	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзмененииУслуги(ТекущиеДанные)
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ОбновитьСрокиАрендыСпроситьОбИзменении(ТекстВопроса, ВариантДействия)
	
	ДополнительныеПараметры = Новый Структура("ВариантДействия", ВариантДействия);
	Оповещение = Новый ОписаниеОповещения("ОбновитьСрокиАрендыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Вопрос");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСрокиАрендыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСрокиАренды(ДополнительныеПараметры.ВариантДействия);		
	КонецЕсли;                                                       	
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ДатаЗаключенияДоговора = Результат.ДатаНачала;
		Объект.ДатаОкончанияДоговора = Результат.ДатаОкончания;	
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаЗаключенияДоговора");
		Объект.ДатаЗаключенияДоговора = '00010101';
		Возврат;
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) Тогда
		ОбновитьСрокиАрендыСпроситьОбИзменении("Выровнять сроки аренды по периоду действия договора?", 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Объект.НаправлениеДеятельности = Объект.Договор.НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Если ВыбранноеЗначение <> ТекущийДоговор Тогда
		
		Объект.Договор = ВыбранноеЗначение;
		
		Если ПолучитьСтавкуНДСПоДоговору(Объект.Договор) <> ПолучитьСтавкуНДСПоДоговору(ТекущийДоговор) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДоговорОбработкаВыбораПродолжение",ЭтотОбъект);
		
		Если Объект.ПостояннаяЧастьАренднойПлаты.Количество()+Объект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда
			
			ПоказатьВопрос(ОписаниеОповещения,"Изменить ставку НДС в табличных частях?",РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийДоговор = Объект.Договор;
	
	ДоговорПриИзменении(Элемент);
	
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОбработкаВыбораПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтавкаНДС = ПолучитьСтавкуНДСПоДоговору(Объект.Договор);
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПостояннаяЧастьАренднойПлаты Цикл
		
		СтрокаТЧ.СтавкаНДС = ТекСтавкаНДС;
		//СтрокаТЧ.Ставка = ПолучитьСтавку(Объект.Дата,СтрокаТЧ.ОбъектАренды,СтрокаТЧ.Номенклатура,Объект.Договор,СтрокаТЧ.СпособНачисления,СтрокаТЧ.Ставка);
		
	КонецЦикла;	
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПеременнаяЧастьАренднойПлаты Цикл
		
		СтрокаТЧ.СтавкаНДС = ТекСтавкаНДС;
		//ПолучитьСтавку(Объект.Дата,СтрокаТЧ.ОбъектАренды,СтрокаТЧ.Номенклатура,Объект.Договор,СтрокаТЧ.СпособНачисления,СтрокаТЧ.Ставка);
		
	КонецЦикла;

	ЗаполнитьСуммыПостояннойЧасти();
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДСПоДоговору(Договор)
	
	Возврат ?(ЗначениеЗаполнено(Договор.СтавкаНДС),Договор.СтавкаНДС,Перечисления.СтавкиНДС.БезНДС);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавку(Дата,ОбъектАренды,Услуга,Договор,СпособНачисления,ТекущаяСтавка)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АУН_СтавкиСрезПоследних.Ставка КАК Ставка
	|ИЗ
	|	РегистрСведений.АУН_Ставки.СрезПоследних(
	|			&Дата,
	|			Услуга = &Услуга
	|				И ОбъектАренды = &ОбъектАренды
	|				И Договор = &Договор) КАК АУН_СтавкиСрезПоследних";
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ставка;
	КонецЕсли;
		
	Возврат ТекущаяСтавка;
	
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьПризнакВключенияНДСВЦенуИзСоглашения(Соглашение)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Соглашение);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоглашенияСКлиентами.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ЦенаВключаетНДС;
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьПризнакВключенияНДСВЦенуИзСоглашения()

#КонецОбласти
